src/DataProcessors/ПечатьКарточкаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьКарточкаКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНастроек</Name>
					<Comment>Список настроек</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДопКонтИнф</Name>
					<Comment>Выводить дополнительную контактную информацию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоОсновные</Name>
					<Comment>Выводить только основные</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ПечатьКарточкаКлиента/Forms/Форма/Ext/Form/Module.bsl
// Модуль основной формы обработки "ПечатьКарточкаКлиента"

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПроверкаДанных(МассивЭлементов)
	МассивИндексов = Новый Массив;
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если Элемент.ЭтоГруппа Тогда
			МассивИндексов.Добавить(МассивЭлементов.Найти(Элемент));
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИндексов.Количество() > 0 Тогда 
		СписокДляСортировки = Новый СписокЗначений();
		СписокДляСортировки.ЗагрузитьЗначения(МассивИндексов);
		СписокДляСортировки.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		МассивИндексов = СписокДляСортировки.ВыгрузитьЗначения();	
		Для Каждого Элемент Из МассивИндексов Цикл 
			МассивЭлементов.Удалить(Элемент);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивЭлементов;
КонецФункции

&НаСервере
Процедура ЗаполнитьНастойкиОтчета()
	Объект.СписокНастроек.Очистить();
	Объект.СписокНастроек.Добавить("РегистрационнаяИнформация", НСтр("ru = 'Регистрационная информация'")               , Истина);
	Объект.СписокНастроек.Добавить("КонтактнаяИнформация", НСтр("ru = 'Контактная информация'")                         , Истина);
	Объект.СписокНастроек.Добавить("КонтактныеЛица", НСтр("ru = 'Контактные лица'")                                     , Истина);
	Объект.СписокНастроек.Добавить("КонтактнаяИнформацияКЛ", НСтр("ru = 'Контактная информация контактных лиц'")        , Истина);
	Объект.СписокНастроек.Добавить("ПодтверждающиеДокументыКЛ", НСтр("ru = 'Подтверждающие документы контактных лиц'")  , Истина);
	Объект.СписокНастроек.Добавить("ДополнительнаяИнформацияКЛ", НСтр("ru = 'Дополнительная информация контактных лиц'"), Истина);
	Объект.СписокНастроек.Добавить("Кураторы","Кураторы"                                                  , Истина);
	Объект.СписокНастроек.Добавить("БанковскиеСчета", НСтр("ru = 'Банковские счета'")                                   , Истина);	
	Объект.СписокНастроек.Добавить("ДоговорыКонтрагента", НСтр("ru = 'Договоры контрагента'")                           , Истина);	
	Объект.СписокНастроек.Добавить("ПодтверждающиеДокументы", НСтр("ru = 'Подтверждающие документы'")                   , Истина);	
	Объект.СписокНастроек.Добавить("ДисконтныеКарты", НСтр("ru = 'Дисконтные карты'")                                   , Истина);	
	Объект.СписокНастроек.Добавить("ДополнительнаяИнформация", НСтр("ru = 'Дополнительная информация'")                 , Истина);	
	
	Объект.ВыводитьДопКонтИнф = Истина;
	Объект.ВыводитьТолькоОсновные = Ложь;
				
КонецПроцедуры// ЗаполнитьНастойкиОтчета()

&НаСервере
Функция ПроверкаЭтаГруппа(ВыбранноеЗначение)
	Возврат ВыбранноеЗначение.ЭтоГруппа	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды = ЭтотОбъект.Контрагенты.ВыгрузитьЗначения();
	ПараметрКоманды = ПроверкаДанных(ПараметрКоманды);
	Настройки = Новый Структура;
	Настройки.Вставить("СписокНастроек", Объект.СписокНастроек);
	Настройки.Вставить("ВыводитьТолькоОсновные", Объект.ВыводитьТолькоОсновные);
	ПараметрыПечати = Новый Структура("СтруктураНастроек, ЗаголовокФормы", Настройки, НСтр("ru = 'Карточка клиента'"));
	Если ПараметрКоманды.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьКарточкаКлиента",
		"ПФ_MXL_КарточкаКлиента",
		ПараметрКоманды,
		Неопределено,
		ПараметрыПечати);		
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не выделен ни один контрагент.'"),Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВсе(Команда)
	Для Каждого Эл Из Объект.СписокНастроек Цикл
		Эл.Пометка = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Эл Из Объект.СписокНастроек Цикл
		Эл.Пометка = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура("ЭтоГруппа", Ложь));

	ОткрытьФорму("Справочник.Контрагенты.ФормаСписка",ПараметрыФормыВыбора, Элементы.Контрагенты,,,,,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагенты") Тогда
		Для Каждого ТекЭлементы Из Параметры.Контрагенты Цикл
			ЭтотОбъект.Контрагенты.Добавить(ТекЭлементы.Ссылка,ТекЭлементы.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЗаполнитьНастойкиОтчета();
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПометкаПриИзменении(Элемент)
	Если Объект.СписокНастроек[2].Пометка = Ложь Тогда
		Объект.СписокНастроек[3].Пометка = Ложь;
		Объект.СписокНастроек[4].Пометка = Ложь;
		Объект.СписокНастроек[5].Пометка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ПроверкаЭтаГруппа(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		Если Контрагенты.НайтиПоЗначению(ВыбранноеЗначение) <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
